<a href="https://colab.research.google.com/github/eunjikim123/Data-Study/blob/test/Day2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
%load_ext sql

# ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://guest:Guest1234@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

'Connected: guest@dev'

In [2]:
%%sql

SELECT *
FROM raw_data.user_session_channel limit 5;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(1491, '00029153d12ae1c9abe59c17ff2e0895', 'Organic'),
 (59, '0002ac0d783338cfeab0b2bdbd872cda', 'Naver'),
 (117, '0006246bee639c7a7b11a08e34dd3cc6', 'Youtube'),
 (572, '0006dd05ea1e999ddaa041a7091b7b36', 'Organic'),
 (935, '0007cda84fafdcf42f96c4f4adb7f8ce', 'Google')]

In [3]:
%%sql

select * from raw_data.session_timestamp limit 5;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('00029153d12ae1c9abe59c17ff2e0895', datetime.datetime(2019, 10, 18, 14, 14, 5, 100000)),
 ('0004289ee1c7b8b08c77e19878106ae3', datetime.datetime(2019, 11, 16, 21, 20, 14, 447000)),
 ('0006246bee639c7a7b11a08e34dd3cc6', datetime.datetime(2019, 8, 10, 16, 33, 14, 980000)),
 ('0006dd05ea1e999ddaa041a7091b7b36', datetime.datetime(2019, 7, 6, 19, 54, 15, 83000)),
 ('000958fdaefe0dd06f5d7c4e4a5f28d1', datetime.datetime(2019, 11, 2, 14, 52, 30, 183000))]

In [7]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID) -- COUNT(1)
FROM raw_data.session_timestamp
GROUP BY 1 
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 9, 26), 561),
 (datetime.date(2019, 10, 16), 627),
 (datetime.date(2019, 5, 22), 251),
 (datetime.date(2019, 8, 13), 603),
 (datetime.date(2019, 11, 2), 556),
 (datetime.date(2019, 6, 15), 343),
 (datetime.date(2019, 10, 26), 571),
 (datetime.date(2019, 9, 20), 536),
 (datetime.date(2019, 10, 12), 619),
 (datetime.date(2019, 8, 5), 561)]

In [23]:
%%sql

select Date(a.ts) date,  count( Distinct b.userid)
from raw_data.session_timestamp as a  join raw_data.user_session_channel as b 
on a.sessionid = b.sessionid 
group by Date(a.ts)
limit 5;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(datetime.date(2019, 10, 18), 528),
 (datetime.date(2019, 7, 23), 434),
 (datetime.date(2019, 8, 1), 442),
 (datetime.date(2019, 10, 12), 511),
 (datetime.date(2019, 11, 6), 516)]

In [28]:
%%sql

select Date(a.ts) date,  count( Distinct b.userid)
from raw_data.session_timestamp as a  join raw_data.user_session_channel as b 
on a.sessionid = b.sessionid 
where Date(a.ts) like '2019-11%'
group by Date(a.ts)
limit 5;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(datetime.date(2019, 11, 22), 496),
 (datetime.date(2019, 11, 26), 504),
 (datetime.date(2019, 11, 17), 470),
 (datetime.date(2019, 11, 13), 515),
 (datetime.date(2019, 11, 1), 511)]

In [27]:
%%sql

select to_char(a.ts, 'YYYY-MM') as date,  count( Distinct b.userid)
from raw_data.session_timestamp as a  join raw_data.user_session_channel as b 
on a.sessionid = b.sessionid 
group by date
order by date DESC
limit 5;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('2019-11', 721),
 ('2019-10', 763),
 ('2019-09', 639),
 ('2019-08', 662),
 ('2019-07', 623)]

In [30]:
%%sql

SELECT distinct userid
FROM raw_data.user_session_channel limit 5;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(1197,), (1401,), (1667,), (468,), (711,)]

In [ ]:
print("done")